[{"Id":1,"Name":"Cast Away","ReleaseYear":2000,"CountryCode":"us","Synopsis":"Travaillant pour FedEx, Chuck Noland est appelé en urgence sur un vol le soir de Noël, alors qu'il dînait avec sa fiancée et sa famille. Victime d'une grave avarie, l'avion cargo s'écrase et il est le seul à en réchapper. Il se retrouve sur une île déserte de l'océan Pacifique. L'endroit étant entouré de barrières de corail infranchissables, il n'a d'autre choix que d'apprendre à survivre. Tout au long de son séjour qui dure plus de quatre ans, il tiendra pyschologiquement en entretenant une amitié imaginaire avec un ballon de volley-ball qu'il a nommé Wilson. Le ballon provient d'un des multiples colis de la cargaison FedEx échoués sur l'île, qui contiennent divers objets clés pour la survie du héros.","Poster":"/Images_Data/Movie_Posters/637ecc89-e273-41b0-b0a6-628a40a00adc.Jpeg"},{"Id":2,"Name":"Forest Gump","ReleaseYear":1994,"CountryCode":"us","Synopsis":"Le film relate la vie mouvementée de Forrest Gump (incarné par Tom Hanks), un « simple d'esprit » originaire de l'Alabama qui se retrouve impliqué  le plus souvent involontairement  dans les principaux événements qui marquent l'histoire des États-Unis d'Amérique, entre les années 1950 et les années 1980, Forrest en étant même parfois l'instigateur.\r\n\r\nLe film a été distingué par six Oscars du cinéma en 1995 (dont ceux du meilleur film, du meilleur réalisateur pour Robert Zemeckis et du meilleur acteur pour Tom Hanks). En 2011, le film est sélectionné par la National Film Registry de la Bibliothèque du Congrès pour y être conservé, en raison de son intérêt « culturellement, historiquement ou esthétiquement important ».","Poster":"/Images_Data/Movie_Posters/079c9ae6-469e-42a0-a062-875dc3372fe7.Jpeg"},{"Id":3,"Name":"King Kong","ReleaseYear":2005,"CountryCode":"us","Synopsis":"Kin Kong est un monstre de fiction ayant l'apparence d'un gorille géant. Il apparaît initialement en 1933 dans le film du même nom, réalisé par Merian C. Cooper et Ernest B. Schoedsack. King Kong devient rapidement une icône du cinéma fantastique et, depuis les années 1930, connaît de nombreuses adaptations (dessins animés, romans, comics, jeux vidéo, parcs à thème). L'image de ce gorille géant, tenant dans sa main une jeune femme et affrontant des avions au sommet d'un gratte-ciel, est fortement ancrée dans la culture populaire.","Poster":"/Images_Data/Movie_Posters/df8fca96-9470-4a73-a4cc-a9b332e82875.Jpeg"},{"Id":4,"Name":"Spider-Man","ReleaseYear":2002,"CountryCode":"us","Synopsis":"Mordu par une araignée génétiquement modifiée, un lycéen nerveux, timide et maladroit acquiert des capacités semblables à celles d'une araignée qu'il doit utiliser pour combattre le mal.","Poster":"/Images_Data/Movie_Posters/3d6ded35-1aa9-4fc9-abfe-34f2a4f6ca3c.Jpeg"},{"Id":5,"Name":"Iron Man","ReleaseYear":2008,"CountryCode":"ca","Synopsis":"Il raconte les origines et les débuts du personnage éponyme issu du comics publié par Marvel. Il s'agit de la première production de l'univers cinématographique Marvel, et du premier film de la phase une.\r\n\r\nCe film marque aussi le retour au succès au box-office de Robert Downey Jr., qui connaît grâce à ce rôle un regain de popularité. Le film récolte effectivement 585 millions de dollars pour un budget de 140 millions et sera suivi en 2010 d'Iron Man 2.\r\n\r\nEn 2022, le film est sélectionné par la National Film Registry de la Bibliothèque du Congrès pour y être conservé, comme étant « culturellement, historiquement ou esthétiquement important.","Poster":"/Images_Data/Movie_Posters/215e442d-eb70-49f1-b83b-bf0e2e23a961.Jpeg"},{"Id":7,"Name":"The pianist","ReleaseYear":2002,"CountryCode":"fr","Synopsis":"Durant la Seconde Guerre mondiale, Wladyslaw Szpilman, un célèbre pianiste juif polonais, échappe à la déportation mais se retrouve parqué dans le ghetto de Varsovie dont il partage les souffrances, les humiliations et les luttes héroïques. Il parvient à s'en échapper et se réfugie dans les ruines de la capitale. Un officier allemand, qui apprécie sa musique, l'aide et lui permet de survivre. Né en Pologne en 1911, Wladyslaw Szpilman devient un pianiste et compositeur célèbre. Il est engagé en 1935 par la radio d'Etat polonaise mais est victime comme les autres Juifs de Pologne de l'antisémitisme nazi à partir de l'invasion nazie en septembre 1939. Il échappe à la mort grâce à l'aide d'un officier allemand. En 1946, le pianiste virtuose publie ses mémoires sous le titre Mort de la ville.","Poster":"/Images_Data/Movie_Posters/f2feb43f-be02-4d65-93c4-2d4c7cfa8a02.Jpeg"},{"Id":8,"Name":"Spider-Man II","ReleaseYear":2004,"CountryCode":"us","Synopsis":"Peter Parker est accablé d'ennuis dans sa vie personnelle alors qu'il affronte un scientifique nommé Docteur Otto Octavius.","Poster":"/Images_Data/Movie_Posters/d9506629-f060-4a50-ab57-e4dbc91c6e68.Jpeg"},{"Id":9,"Name":"Star Trek : First contact","ReleaseYear":1996,"CountryCode":"us","Synopsis":"Les Borgs sont des entités moitié organiques, moitié machines. Leur seul but est de conquérir et assimiler toutes les autres races dans le but de devenir des êtres parfaits. Conduits par leur répugnante et maléfique Reine Borg, ils se dirigent vers la Terre pour changer le cours de l'histoire. Lors de sa dernière rencontre avec les Borgs, le capitaine Jean-Luc Picard a failli mourir : son être intime a subi l'équivalent d'un viol, et il a surtout été forcé de collaborer, par l'utilisation de sa voix de terrien, à la destruction de milliers de personnes. Il est maintenant rongé par un désir profond de vengeance qu'il ne parvient pas à maîtriser.\r\n\r\nLe capitaine et son nouveau vaisseau, l'USS Enterprise (NCC-1701-E) de classe Sovereign, retournent sur Terre à la date du 4 avril 2063, veille du Jour du Premier Contact, un jour fondamental pour l'Humanité, pour empêcher les plans des maléfiques Borgs : assimiler la Terre en détruisant le Phoenix, premier vaisseau capable de voler grâce au principe de la distorsion. Mais entretemps, les Borgs prennent d'assaut l'Enterprise pour une lutte sans merci. Le capitaine fait alors la connaissance de Zefram Cochrane, l'inventeur terrien de cette distorsion et constructeur du Phoenix. Grâce à d'habiles manuvres, Picard et son équipage arrivent à rendre de nouveau possible le Premier Contact entre Humains et Vulcains, donnant toutes les chances à la Fédération de vaincre un jour les Borgs.","Poster":"/Images_Data/Movie_Posters/7607a1cc-c37b-44f1-b717-1665ac5acbc3.Jpeg"},{"Id":10,"Name":"The Green Mile","ReleaseYear":1999,"CountryCode":"us","Synopsis":"Les vies des gardes du couloir de la mort sont touchées par l'un des détenus: un homme noir accusé de meurtre et de viol d'enfants, doté d'un pouvoir mystérieux.","Poster":"/Images_Data/Movie_Posters/d1f8b666-efd8-4bb4-8cbc-69083315a3a5.Jpeg"}]
